# Create
a ='привет' # одинарные кавычки
b = "привет" # двойные кавычки
c = "я 'знаю' Python" # комбинированные кавычки
d = 'я "знаю" Python' # можно и так
e = 'я "знаю' Python" # а так нельзя(кавычки вперемешку)
a = 123 # целочисленный тип
a = str(a) # результат, '123'
str([1, 1.1, 'a']) # результат, [1, 1.1, 'a']
str(True) # результат, 'True'
str(None) # результат, 'None'
a = 'привет'
b = 'Иван'
c = f"{a} я {b}"


# Retrive(Read)
a = 'привет'
print(a)
print('Иван')
a = 'привет'
a[0]
a[1]
a[2]
a[3]
a[4]
a[5]
a[6]
a[-1]
a[-2]
a[-3]
a[-4]
a[-5]
a[-6]
a[-7]


# Update
a = 'привет'
a[0] = 'б'
a = 'бпривет'


# Delete
a ='привет'
del a[0]
del a


# Действия с объектами
    # сложение строк со строками
a = 'привет'
b = 'Мир'
c = a + b
print(c)
c += b
    # умножение строк на целое число
a = 'привет'
 = 2
c = a * b
print(c)
a *= b
    # остальные арифметические действия со строками не поддерживаются
a = ''
b = ""
c = str()






