#create tuple
a = [1, 2.1, 3]
tuple(a)
b = tuple('abc')
#retrive
a = (1, 1.1, 'a')
print(a)
print((1, 1.1, 'a'))

a = (1, 1.1, 'a')
a[0]
a[1]
a[2]
a[3]
a[-1]
a[-2]
a[-3]
a[-4]
#update
a = (1, 1.1, 'a')
a = (1, 2, 3)
#delete
a = (1, 1.1, 'a')
del a
#Действия с кортежом tuple
    #складывать с кортежами
a = (1, 2, 3)
b = (4, 5, 6)
c = a + b
print(c)
a += b
    #умножать на целое число
a = (1, 2, 3)
b = 2
c = a * b
print(c)
a *= b
#Действия с объектами
    #делать вложенными
a = (1, 2, 3)
b = ((1, 2, 3),(4, 5, 6),(7, 8, 9))

b = ((1, 2, 3),(4, 5, 6),(7, 8, 9))
b[0]
b[0][0]
b[-1][-1]
#методы tuple
help(tuple)
a = (1, 2, 1)
a.count(1)
a.index(2)
#Практические моменты
a = (1, 2,[1, 2, 3])
a[2][0] = 10
a = [1, 2, 3]
b = (1, 2, a)
a[1] = 20
print(b)

#create dict
a = {'a':1}
a = {'a':1,'b':2}
a = dict([['a',1],['b',2]])
a = dict(a=1, b=2)

a = {}
b = dict()
a = dict([['a',1],['b',2]])
a = dict((('a',1),('b',2)))
a = {1:'a', 1.1:'b','c':3,(1,2):[1, 2, 3],frozenset((1,2)):{1, 2},4:{1:2, 3:4},print:4}
a = {'a':1,'a':3,'b':2}
#retrive
a = {'a':1, 'b':1.1}
print(a)
print({'a':1, 'b':1.1})

a = {'a':1, 'b':1.1,1:'abc'}
a[0]
a['a']
a['b']
a[1]
var_b = 'b'
a[var_b]

a = {'a':1, 'b':1.1,1:'abc'}
a.get('a')
a.get(0)
a.get(0, 'a')
#update
    #Добавление
a = a = {'a':1, 'b':1.1}
a['c'] = 2

a = {'a':1, 'b':1.1}
a.setdefault('c', 2)

a = {'a':1, 'b':1.1}
a.update({'a':10,'c':'abc'})
    #Изменение
a = {'a':1, 'b':1.1}
a['b'] = 2
    #Метод setdefault не может изменить уже созданный эдемент
a = {'a':1, 'b':1.1}
a.setdefault('b',2)
#delete
a = {'a':1, 'b':1.1}
del a['a']
del a
a = {'a':1, 'b':1.1}
a.clear()
a = {'a':1, 'b':1.1}
a.popitem()
a = {'a':1, 'b':1.1}
a.pop('a')
#действия с объектами
a = {'a':1, 'b':1.1}
b = {'a':1,'b':['c':10]}

b = {'a':1,'b':['c':10]}
b['b']
b['b']['c']
#методы
help(dict)
a = {'a':1, 'b':1.1}
a.copy()
a.values()
a.keys()
a.items()
dict.fromkeys(['a','b','c'], 10)
#практические илиенты
products = {'апельсин':{'цена':100,'вес':0.5},'банан':{'цена':110,'вес':1}}
products['апельсин']['цена']
products['банан']
banan = produts['банан']
banan['вес']
